def area(a, b):
    ''' 
    Принимает длину двух сторон прямоугольника и возвращает его площадь 
    Параметры:
        a (int): длина одной из сторон прямоугольника
        b (int): длина другой стороны прямоугольника
    Возвращаемое значение:
        a*b (int): площадь прямоугольника
    '''
    return a*b

def perimeter(a, b):
    ''' 
    Принимает длину двух сторон прямоугольника и возвращает его периметр 
    Параметры:
    a (int): длина одной из сторон прямоугольника
    b (int): длина другой стороны прямоугольника
    Возвращаемое значение:
        2 * (a+b) (int): периметр прямоугольника
    '''
    return 2 * (a+b)
