def area (a, h):
    '''
    Принимает высоту и сторону треугольника, на которую падает эта высота, и возвращает его плошадь
    Параметры:
        a (int): длина стороны треугольника
        h (int): длина высоты треугольника, падающей на сторону, длина которой указана в а
    Возвращаемое значение:
        a*h/2 (float): площадь треуголька
    '''
    return a*h/2

def perimeter (a, b, c):
    '''
    Принимает длины трёх сторон треугольника и возвращает его периметр
    Параметры:
        a (int): длина первой стороны треугольника
        b (int): длина второй стороны треугольника
        c (int): длины третей стороны треугольника
    Возвращаемое значение:
        a+b+c (int): периметр треугольника
    '''
    return a+b+c

